backend/app/controllers/dealers_controller.rb

    def index
        fetch_and_store_dealers unless Dealer.exists?
---
SELECT "dealers".* FROM "dealers"